[
{ "spurious": "Not being what it purports to be; false or fake." },
{ "specious": "Superficially plausible, but actually wrong; misleading in appearance, especially misleadingly attractive." },
{ "apophenia": "The tendency to perceive meaningful connections between unrelated things." },
{ "apophasis": "The raising of an issue by claiming not to mention it." },
{ "vespertilionize": "To turn yourself or something else (especially another living thing) into a bat." },
{ "aetites": "The eagle-stone; a hollow pebble containing yet another pebble, fabled to be found in an eagle's nest and supposedly capable of detecting theft." },
{ "barghest": "A goblin which takes the form of a dog, appearing as an omen of death or misfortune." },
{ "bocstaff": "A letter of the alphabet." },
{ "chiminage": "A toll paid for passage through a forest." },
{ "colubriferous": "Bearing or bringing forth snakes." },
{ "diapente": "1. A medicine composed of five ingredients, or, 2. As used in ancient and medieval music, the harmony or consonance of a perfect fifth interval." },
{ "dipsas": "A fabled serpent whose bite produces a raging thirst." },
{ "enantiodromia": "The process wherrein a thing is replaced by its opposite, and the subsequnt interaction of the two." },
{ "engastration": "The stuffing of a bird inside another." },
{ "eutrapely": "Eloquent or witty conversatioEloquent or witty conversation." },
{ "filipendulous": "Hanging by a thread." },
{ "frantling": "The mating cry of a peacock." },
{ "halikeld": "A sacred well." },
{ "hederated": "Wearing a crown of ivy." },
{ "idolum": "1. A specter, or, 2. an idea, or, 3. a fallacy." },
{ "inquiline": "1. Dwelling in the nest of another species, or an animal which does so, or, 2. A sojourner." },
{ "interlucation": "The thinning of trees to allow the entrance of light." },
{ "jargonelle": "An early-ripening pear." },
{ "jornada": "1. An act of a play, or, 2. a long day's journey made without water." },
{ "kantikoy": "To dance in worship, celebration, or in honor of the dead." },
{ "kae": "1. A jackdaw's cry, or, 2. A jackdaw itself; or 3. Clever." },
{ "latitant": "1. Hiding, as in refuge or in wait of ambush, or, 2. that which hides or is latent." },
{ "lecithal": "A word utilized to describe those egg cells possessing a yolk." },
{ "levigate": "To smooth, burnish, grind, or polish, bringing to a state of extreme shininess or to a fine powder." },
{ "locutory": "A room set aside (originally in a monastery) for the purposes of conversation." },
{ "mulligrubs": "In a state of ill temper or indigestion." },
{ "myropolist": "One who sells perfumes." },
{ "scytale": "1. A serpent mentioned by ancient writers, resembling a cylindrical staff of uniform thickness, or, 2. A method of secret writing, practiced in Sparta, in which a strip of writing was wound around a tapering staff so that the writing could not be read, and could only be interpreted when wound around a staff of precisely the right form and size." }
]
